app/controllers/orders_controller.rb

INSERT INTO "orders" ("total", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["total", 0.0], ["created_by", "1"], ["created_at", "2018-03-09 13:26:04.524524"], ["updated_at", "2018-03-09 13:26:04.524524"]]
INSERT INTO "order_products" ("order_id", "product_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["order_id", 3], ["product_id", 2], ["quantity", 1], ["created_at", "2018-03-12 19:34:54.497059"], ["updated_at", "2018-03-12 19:34:54.497059"]]
UPDATE "orders" SET "total" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["total", 53.018], ["updated_at", "2018-03-12 19:34:54.494439"], ["id", 3]]
---
  def create
    puts "REACHES CREATE ORDER ---------"
    order = current_user.orders.create!
    order.build_order_with_product_ids_and_quantities(params[:order][:product_ids_and_quantities])
    order.save

UPDATE "orders" SET "sent" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["sent", "t"], ["updated_at", "2018-03-09 17:17:14.543033"], ["id", 1]]
---
  def update
    @order.update(order_params)