app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    user = User.create!(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Tillman Marvin Jr.532vw"], ["updated_at", "2018-03-08 20:10:40.896960"], ["id", 5]]
---
  def update
    puts params
    user = User.find(params[:id])
    user.update(user_params)